Repository: btd1337/spectator
Catalog: po/extra/*.po
Languages: es, fr

source: REST Client
es: Cliente REST
fr: Client REST

source: REST;HTTP;Client;
es: REST;HTTP;Cliente;

source: Comfortably test your REST APIs!
es: Prueba tus APIs REST cómodamente!
fr: Testez confortablement vos API REST !

source: Gives you the possibilty to test your REST application.
es: Te da la posibilidad de probar tu aplicación REST.
fr: Donnez-vous la possibilité de tester votre application REST.

source: Send custom headers and self defined bodies to your application and displays the response in a clean way.
es: Envia cabeceras personalizadas y cuerpos definidos por ti a tu aplicación y muesta la respuesta de forma clara.
fr: Envoyez des en-têtes personnalisés et des corps auto-définis à votre application et visualisez la réponse d'une manière claire.

source: JavaScript Integration
es: Integración JavaScript
fr: Intégration de JavaScript

source: Adds the possibility to augment your requests with scripting.
es: Añade la posibilidad de aumentar tus peticiones con scripting.
fr: Ajout de la possibilité d'augmenter vos requêtes avec des scripts.

source: The developer can use the 'before_sending' JavaScript function to augment the request.
es: El desarrollador puede usar la función JavaScript 'before_sending' para aumentar la petición.
fr: Le développeur peut utiliser la fonction JavaScript « before_sending » pour augmenter la requête.

source: HTTP.get(url), HTTP.post(url, config) and other request methods are available from script
es: HTTP.get(url), HTTP.post(url, config) y otros métodos de peticiones están disponibles desde script
fr: Les méthodes HTTP.get(url), HTTP.post(url, config) et les autres méthodes sont disponibles depuis le script.

source: URL Params fixes
es: Arreglos en los parámetros de URL
fr: Correction des paramètres d'URL

source: Fixes a bug where the application crashes if a URL param is entered from key-value view without a URL
es: Soluciona un error que provoca que la aplicación se cierre si se introduce un parámetro de URL en la forma clave-valor sin una URL
fr: Correction d'un bug où l'application plantait si le paramètre d'URL était entré depuis une valeur clé sans URL.

source: Initial Release
es: Versión inicial
fr: Version initiale
